## Introduction to Data Analysis with Python

### Python has very rich data analysis ecosystem supported by the academic field

### We will focus only on a specific library - Pandas

Pandas official documentation: https://pandas.pydata.org/pandas-docs/stable/

In [17]:
# The work with Pandas usually begins like this:
import pandas as pd

# Read CSV file into Pandas DataFrame
df = pd.read_csv('sample.csv')

# But that is not the only way -
numbers = [1, 2, 3, 4, 5]
words = ['one', 'two', 'three', 'four', 'five']

# Create Series (array like structures) of data 
number_series = pd.Series(numbers)
word_series = pd.Series(words)

# Construct a dictionary to identify column names of our DataFrame
number_word_dict = {
    'numbers': numbers,
    'words': words
}

# Pass it to DataFrame constructor
df2 = pd.DataFrame().from_dict(number_word_dict)

# Output dataframes just by writing variable name (one output per cell)
df2

   numbers  words
0        1    one
1        2    two
2        3  three
3        4   four
4        5   five

In [21]:
# Finding amount of rows - the classic way. Seriously, len() is pretty good in Python
len(df2)

5

### Explore the DataFrame

In [31]:
# Print first rows
df2.head()

# Print last 2 rows
df2.tail(2)

# Random sample of 3 rows
df2.sample(3)

# Calculate statistical measures of the DataFrame
df2.describe()

# Memory footprint and kind of cool stuff
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
numbers    5 non-null int64
words      5 non-null object
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

### Modifying the DataFrame

In [43]:
# New column? Why not
df2['column'] = 1

# Why not make it more exciting - value from two existing columns
df2['numbers_and_words'] = df2.apply(lambda x: "{} - {}".format(x.numbers, x.words), axis=1)

df2

   numbers  words numbers_and_words  column
0        1    one           1 - one       1
1        2    two           2 - two       1
2        3  three         3 - three       1
3        4   four          4 - four       1
4        5   five          5 - five       1

In [85]:
# Let's create an empty column
df2['empty'] = np.nan

df2

   numbers  words numbers_and_words  column     <3     >3  empty
4        5   five          5 - five       1  False   True    NaN
3        4   four          4 - four       1  False   True    NaN
2        3  three         3 - three       1  False  False    NaN
1        2    two           2 - two       1   True  False    NaN
0        1    one           1 - one       1   True  False    NaN

In [92]:
# Now replace missing values
df2.fillna("not so empty anymore", inplace=True)

df2

,numbers,words,numbers_and_words,column,<3,>3,empty
4,5,five,5 - five,1,False,True,not so empty anymore
3,4,four,4 - four,1,False,True,not so empty anymore
2,3,three,3 - three,1,False,False,not so empty anymore
1,2,two,2 - two,1,True,False,not so empty anymore
0,1,one,1 - one,1,True,False,not so empty anymore

In [93]:
# We can also create columns based on conditional logic :)
# However, we need an extra dependency to make it simpler
import numpy as np

df2['<3'] = np.where(df2['numbers'] < 3, True, False)

df2

,numbers,words,numbers_and_words,column,<3,>3,empty
4,5,five,5 - five,1,False,True,not so empty anymore
3,4,four,4 - four,1,False,True,not so empty anymore
2,3,three,3 - three,1,False,False,not so empty anymore
1,2,two,2 - two,1,True,False,not so empty anymore
0,1,one,1 - one,1,True,False,not so empty anymore

In [63]:
# Yes, we could have done it with Pandas too
df2['>3'] = df2.apply(lambda row: row['numbers'] > 3, axis=1)

df2

   numbers  words numbers_and_words  column     <3     >3
4        5   five          5 - five       1  False   True
3        4   four          4 - four       1  False   True
2        3  three         3 - three       1  False  False
1        2    two           2 - two       1   True  False
0        1    one           1 - one       1   True  False

In [97]:
# Select word from the second row
df2.words.iloc[1]

'four'

### Filtering data in DataFrame

In [98]:
# Selecting only couple columns of the DataFrame
df2[['numbers', 'words']]

   numbers  words
4        5   five
3        4   four
2        3  three
1        2    two
0        1    one

In [99]:
# Filter data directly
filtered_data = df2[df2['words'] == "three"]

filtered_data

,numbers,words,numbers_and_words,column,<3,>3,empty
2,3,three,3 - three,1,False,False,not so empty anymore

In [100]:
# Can be a separate filter with multiple conditions too
data_filter = (df2['numbers'] > 2) & (df2['words'].str.startswith('t'))

# Now, pass the filter to DataFrame
df2[data_filter]

,numbers,words,numbers_and_words,column,<3,>3,empty
2,3,three,3 - three,1,False,False,not so empty anymore

### Sorting values

In [101]:
# Sort values in descending order
df2.sort_values('numbers_and_words', ascending=False)

# Hmm? That does not seem to have worked as expected
df2

,numbers,words,numbers_and_words,column,<3,>3,empty
4,5,five,5 - five,1,False,True,not so empty anymore
3,4,four,4 - four,1,False,True,not so empty anymore
2,3,three,3 - three,1,False,False,not so empty anymore
1,2,two,2 - two,1,True,False,not so empty anymore
0,1,one,1 - one,1,True,False,not so empty anymore

In [102]:
# Let's run it inplace, perhaps
df2.sort_values('numbers_and_words', ascending=False, inplace=True)

# This looks much better - you don't need to do inplace operations, if you are assigning the return
# to another variable eg. df3 = df2.sort_values('numbers')
df2

,numbers,words,numbers_and_words,column,<3,>3,empty
4,5,five,5 - five,1,False,True,not so empty anymore
3,4,four,4 - four,1,False,True,not so empty anymore
2,3,three,3 - three,1,False,False,not so empty anymore
1,2,two,2 - two,1,True,False,not so empty anymore
0,1,one,1 - one,1,True,False,not so empty anymore

In [103]:
from collections import OrderedDict

products = ["Apples", "Bananas", "Dell XPS", "Hearthstone Packs"]

prices = [1.50, 1.20, 2000.54, 49.99]

# Lets create  a DataFrame with set column order
price_df = pd.DataFrame().from_dict(OrderedDict({
    "product": products,
    "price": prices
}))

price_df

             product    price
0             Apples     1.50
1            Bananas     1.20
2           Dell XPS  2000.54
3  Hearthstone Packs    49.99

In [104]:
# Price category bins
bins = [1, 10, 50, 2500]

# Price tags for bins
tags = ['Cheap', 'Affordable', 'Expensive']

# Let's translate price category to Price tags and add it to our price DataFrame
price_df['Price Bracket'] = pd.cut(price_df['price'], bins, labels=tags)

In [105]:
price_df

             product    price Price Bracket
0             Apples     1.50         Cheap
1            Bananas     1.20         Cheap
2           Dell XPS  2000.54     Expensive
3  Hearthstone Packs    49.99    Affordable

### Loading massive datasets

In [82]:
# For massive dataset loading - use chunking
chunksize = 100
chunks = []

# Iterate over CSV in chunks
for chunk in pd.read_csv('datasets/titanic.csv', chunksize=chunksize):
    chunks.append(chunk)
    
# Concatenate all the chunks
partial_load_df = pd.concat(chunks, axis=0)

partial_load_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
863,864,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
864,865,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
865,866,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
866,867,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
867,868,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
868,869,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
869,870,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
870,871,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
871,872,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
872,873,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
873,874,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
874,875,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
875,876,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
876,877,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
877,878,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
878,879,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
879,880,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
880,881,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
881,882,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
882,883,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
883,884,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
884,885,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
886,887,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
887,888,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,891,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
891,892,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
892,893,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q